---

C#Visual BasicVisual C++

Include Protected MembersInclude Inherited Members

Revit 2024 API
---
ExternalResourceReference Constructor
ExternalResourceReference Class See Also Send Feedback
---

# Overload List

|  | Name | Description |
| --- | --- | --- |
|  | ExternalResourceReference(ExternalResourceReference) | Creates a new ExternalResourceReference from the given ExternalResourceReference. |
|  | ExternalResourceReference(Guid, IDictionary<(Of <<'(String, String>)>>), String, String) | Creates a new ExternalResourceReference from the given data. |

# See Also

ExternalResourceReference Class

ExternalResourceReference Members

Autodesk.Revit.DB Namespace